_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы/Ext/ManagerModule.bsl
#Область РасчетРаздела

Процедура ВыполнитьРасчетТекущегоРаздела(СсылкаРаздел, Акт = Неопределено)
	
	СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(СсылкаРаздел, Акт, "СМ_РазделЛокальнойСметы");
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметровОтбораРС.СсылкаНаСмету) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нарушена структура данных!'"));
		Возврат;
	КонецЕсли;
	
	СМ_СметаРасчетВызовСервера.СформироватьИтогиПоРазделу(СсылкаРаздел, СтруктураПараметровОтбораРС.СсылкаНаСмету, Акт, СтруктураПараметровОтбораРС);
		
КонецПроцедуры

Процедура ВыполнитьРасчет(ОбъектРаздел, ПозицииУжеРассчитаны = Ложь, СметаУжеРассчитана = Ложь, Акт = Неопределено)
	
	Если Не ПозицииУжеРассчитаны Тогда
		
		// Получаем подчиненные разделу позиции локальной сметы
		ТабРезультат = СМ_СметаВызовСервера.ПолучитьТаблицуПодчиненных(ОбъектРаздел.Ссылка, ложь, Истина, Истина, Ложь);
		Для Каждого ТекСтрока Из ТабРезультат Цикл
			// Пересчитываем позиции локальной сметы
			ТекОбъект = ТекСтрока.Ид.ПолучитьОбъект();
			Документы.СМ_ПозицияЛокальнойСметы.Перерасчет(ТекОбъект, Истина, Акт);
		КонецЦикла;
		
		// Получаем подчиненные разделу позиции локальной сметы
		ТабРезультат = СМ_СметаВызовСервера.ПолучитьТаблицуПодчиненных(ОбъектРаздел.Ссылка, Истина, Ложь, Ложь, Ложь);
		Для Каждого ТекСтрока Из ТабРезультат Цикл
			// Пересчитываем разделы локальной сметы
			ТекОбъект = ТекСтрока.Ид.ПолучитьОбъект();
			Документы.СМ_РазделЛокальнойСметы.Перерасчет(ТекОбъект, Ложь, Истина, Акт);
		КонецЦикла;
		
	КонецЕсли;	
	
	Если ТипЗнч(ОбъектРаздел.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
		Если ОбъектРаздел.Расчет Тогда
			ВыполнитьРасчетТекущегоРаздела(ОбъектРаздел, Акт);
		Иначе
			СМ_СметаВызовСервера.УдалитьДвижения(СМ_СметаВызовСервера.ПолучитьСсылкуНаДокумент(ОбъектРаздел,"СМ_РазделЛокальнойСметы"), Акт);
		КонецЕсли;
		
		Если Не СметаУжеРассчитана Тогда
			
			РодительОбъект = ОбъектРаздел.ИДРодителя.ПолучитьОбъект();
			Если ТипЗнч(РодительОбъект.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
				Документы.СМ_РазделЛокальнойСметы.Перерасчет(РодительОбъект, Истина, Ложь, Акт);	
			ИначеЕсли Акт = Неопределено Тогда
				// смета
				Документы.СМ_ЛокальнаяСмета.Перерасчет(РодительОбъект, Истина);
			Иначе
				Документы.СМ_АктВыполненныхРабот.Перерасчет(Акт, Истина);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Основная процедура расчета позиции, выполняет пересчет позиции
// Параметры:
//   РодительОбъект - ДокументОбъект.СМ_РазделЛокальнойСметы или ДокументСсылка.СМ_РазделЛокальнойСметы.
//   ПозицииУжеРассчитаны - Булево - Истина - подчиненные позиции расчитаны и их пересчет не требуется, 
//   					     		 Ложь - требуется пересчет подчиненных позиций.
//   СметаУжеРассчитана - Булево - Истина - смета уже рассчитана и ее пересчет не требуется, 
//   					           Ложь - требуется пересчет вышестоящей сметы.
//   Акт - ДокументОбъект.СМ_АктВыполненныхРабот или ДокументСсылка.СМ_АктВыполненныхРабот.
//         Задается если происходит пересчет позиции акта.
Процедура Перерасчет(РодительОбъект, ПозицииУжеРассчитаны = Ложь, СметаУжеРассчитана = Ложь, Акт = Неопределено) Экспорт
	
	ВыполнитьРасчет(РодительОбъект, ПозицииУжеРассчитаны, СметаУжеРассчитана, Акт);
	
КонецПроцедуры

#КонецОбласти
